apps/backend/src/modules/admin/__tests__/artillery-admin.yml
# Artillery Load Test - Admin Module
# Usage (smoke/default): npx artillery run src/modules/admin/__tests__/artillery-admin.yml
# Usage (full):          npx artillery run --environment full src/modules/admin/__tests__/artillery-admin.yml

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 5
      arrivalCount: 1
      name: "Smoke"

  environments:
    full:
      phases:
        - duration: 30
          arrivalRate: 2
          name: "Warm up"
        - duration: 60
          arrivalRate: 6
          name: "Ramp up"
        - duration: 90
          arrivalRate: 10
          name: "Peak"

scenarios:
  - name: "Admin Overview & Users"
    flow:
      # Register staff and capture token
      - post:
          url: "/api/auth/staff/register"
          json:
            fullName: "Admin Perf User"
            email: "perf.admin.module.{{ $timestamp }}.{{ $randomNumber(1, 1000000) }}@example.com"
            contactNumber: "0771234567"
            role: "Staff"
            password: "StaffPassword123!"
          capture:
            - json: "$.data.token"
              as: "staffToken"
          expect:
            - statusCode: 201

      - get:
          url: "/api/admin/overview"
          headers:
            Authorization: "Bearer {{ staffToken }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/admin/users?role=Staff"
          headers:
            Authorization: "Bearer {{ staffToken }}"
          expect:
            - statusCode: 200